# Jupyter database visual studio code

In [1]:
import pandas as pd

In [2]:
species = ["Cat", "Dog", "Rabbit", "Cow"]

In [3]:
pd.Series(species)

0       Cat
1       Dog
2    Rabbit
3       Cow
dtype: object

In [4]:
animals = pd.DataFrame({"animal": species})
animals

   animal
0     Cat
1     Dog
2  Rabbit
3     Cow

In [5]:
animals["age"] = [2, 3, 4, 5]
animals

   animal  age
0     Cat    2
1     Dog    3
2  Rabbit    4
3     Cow    5

In [6]:
pd.DataFrame([
    {"name": "Apoloniusz", "age": 47},
    {"name": "Konstantyna", "age": 45}
])

          name  age
0   Apoloniusz   47
1  Konstantyna   45

In [7]:
persons = pd.DataFrame([
    {"name": "Apoloniusz", "age": 27},
    {"name": "Konstantyna", "age": 25}
], index=["A", "B"])
persons

          name  age
A   Apoloniusz   27
B  Konstantyna   25

In [2]:
df = pd.read_csv("Titanic.csv")
df

,Name,PClass,Age,Sex,Survived
0,"Allen, Miss Elisabeth Walton",1st,29.00,female,1
1,"Allison, Miss Helen Loraine",1st,2.00,female,0
2,"Allison, Mr Hudson Joshua Creighton",1st,30.00,male,0
3,"Allison, Mrs Hudson JC (Bessie Waldo Daniels)",1st,25.00,female,0
4,"Allison, Master Hudson Trevor",1st,0.92,male,1
...,...,...,...,...,...
1308,"Zakarian, Mr Artun",3rd,27.00,male,0
1309,"Zakarian, Mr Maprieder",3rd,26.00,male,0
1310,"Zenni, Mr Philip",3rd,22.00,male,0
1311,"Lievens, Mr Rene",3rd,24.00,male,0
1312,"Zimmerman, Leo",3rd,29.00,male,0

In [9]:
df.head(10)

,Name,PClass,Age,Sex,Survived
0,"Allen, Miss Elisabeth Walton",1st,29.00,female,1
1,"Allison, Miss Helen Loraine",1st,2.00,female,0
2,"Allison, Mr Hudson Joshua Creighton",1st,30.00,male,0
3,"Allison, Mrs Hudson JC (Bessie Waldo Daniels)",1st,25.00,female,0
4,"Allison, Master Hudson Trevor",1st,0.92,male,1
5,"Anderson, Mr Harry",1st,47.00,male,1
6,"Andrews, Miss Kornelia Theodosia",1st,63.00,female,1
7,"Andrews, Mr Thomas, jr",1st,39.00,male,0
8,"Appleton, Mrs Edward Dale (Charlotte Lamson)",1st,58.00,female,1
9,"Artagaveytia, Mr Ramon",1st,71.00,male,0

In [10]:
df.tail(10)

                        Name PClass   Age     Sex  Survived
1303      Yasbeck, Mr Antoni    3rd  27.0    male         0
1304     Yasbeck, Mrs Antoni    3rd  15.0  female         1
1305      Youssef, Mr Gerios    3rd   NaN    male         0
1306     Zabour, Miss Hileni    3rd   NaN  female         0
1307     Zabour, Miss Tamini    3rd   NaN  female         0
1308      Zakarian, Mr Artun    3rd  27.0    male         0
1309  Zakarian, Mr Maprieder    3rd  26.0    male         0
1310        Zenni, Mr Philip    3rd  22.0    male         0
1311        Lievens, Mr Rene    3rd  24.0    male         0
1312          Zimmerman, Leo    3rd  29.0    male         0

In [11]:
df.sample(10)

                               Name PClass   Age     Sex  Survived
417             Giles, Mr Frederick    2nd  21.0    male         0
781            Drazonovic, Mr Josef    3rd   NaN    male         0
25      Blackwell, Mr Stephen Weart    1st  45.0    male         0
204   Porter, Mr Walter Chamberlain    1st  46.0    male         0
1054           Nosworthy, Richard C    3rd   NaN    male         0
902               Jonkoff, Mr Lazor    3rd   NaN    male         0
576              Ware, Mr William J    2nd  23.0    male         0
1055         jib, Miss Adele Kiamie    3rd   NaN  female         1
834                Guest, Mr Robert    3rd   NaN    male         0
803               Foley, Mr William    3rd   NaN    male         0

In [13]:
df.shape

(1313, 5)

In [14]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1313 entries, 0 to 1312
Data columns (total 5 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Name      1313 non-null   object
 1   PClass    1312 non-null   object
 2   Age       756 non-null    float64
 3   Sex       1313 non-null   object
 4   Survived  1313 non-null   int64
dtypes: float64(1), int64(1), object(3)
memory usage: 51.4+ KB

In [15]:
df.describe()

              Age     Survived
count  756.000000  1313.000000
mean    30.397989     0.342727
std     14.259049     0.474802
min      0.170000     0.000000
25%     21.000000     0.000000
50%     28.000000     0.000000
75%     39.000000     1.000000
max     71.000000     1.000000

In [19]:
column = df["Age"]
column.count(), column.sum(), column.mean(), column.quantile(0.5)

(756, 22980.88, 30.397989417989418, 28.0)

In [20]:
df["PClass"].value_counts()

PClass
3rd    711
1st    322
2nd    279
Name: count, dtype: int64

In [21]:
df["Age"].value_counts()

Age
22.00    35
30.00    31
21.00    31
18.00    30
36.00    29
         ..
0.80      1
67.00     1
0.33      1
0.17      1
69.00     1
Name: count, Length: 75, dtype: int64

In [28]:
df[""].value_counts().sort_values()

Age
69.00     1
0.92      1
7.00      1
70.00     1
0.17      1
         ..
36.00    29
18.00    30
21.00    31
30.00    31
22.00    35
Name: count, Length: 75, dtype: int64

In [29]:
bd = pd.read_csv("Titanic.csv")

In [30]:
bd.sample(10)

                                  Name PClass   Age     Sex  Survived
272                     Weir, Col John    1st  60.0    male         0
1031           Morley, Mr Henry Samuel    3rd   NaN    male         0
475                 Lemore, Mrs Amelia    2nd  34.0  female         1
1091             Olsson, Mr Nils Johan    3rd   NaN    male         0
589   West, Mrs Edwy Arthur (Ada Mary)    2nd  33.0  female         1
866            Hirvonen, Miss Hildur E    3rd   2.0  female         0
796              Everett, Thomas James    3rd   NaN    male         0
976                  Lulich, Mr Nicola    3rd   NaN    male         1
183                  Mock, Mr Philip E    1st   NaN    male         1
223               Saalfeld, Mr Adolphe    1st   NaN    male         1

In [31]:
bd.shape

(1313, 5)

In [33]:
pd.DataFrame(bd)

,Name,PClass,Age,Sex,Survived
0,"Allen, Miss Elisabeth Walton",1st,29.00,female,1
1,"Allison, Miss Helen Loraine",1st,2.00,female,0
2,"Allison, Mr Hudson Joshua Creighton",1st,30.00,male,0
3,"Allison, Mrs Hudson JC (Bessie Waldo Daniels)",1st,25.00,female,0
4,"Allison, Master Hudson Trevor",1st,0.92,male,1
...,...,...,...,...,...
1308,"Zakarian, Mr Artun",3rd,27.00,male,0
1309,"Zakarian, Mr Maprieder",3rd,26.00,male,0
1310,"Zenni, Mr Philip",3rd,22.00,male,0
1311,"Lievens, Mr Rene",3rd,24.00,male,0
1312,"Zimmerman, Leo",3rd,29.00,male,0

In [32]:
bd.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1313 entries, 0 to 1312
Data columns (total 5 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Name      1313 non-null   object
 1   PClass    1312 non-null   object
 2   Age       756 non-null    float64
 3   Sex       1313 non-null   object
 4   Survived  1313 non-null   int64
dtypes: float64(1), int64(1), object(3)
memory usage: 51.4+ KB

In [37]:
bdm = bd.fillna(bd.median(numeric_only=True))
bdm

,Name,PClass,Age,Sex,Survived
0,"Allen, Miss Elisabeth Walton",1st,29.00,female,1
1,"Allison, Miss Helen Loraine",1st,2.00,female,0
2,"Allison, Mr Hudson Joshua Creighton",1st,30.00,male,0
3,"Allison, Mrs Hudson JC (Bessie Waldo Daniels)",1st,25.00,female,0
4,"Allison, Master Hudson Trevor",1st,0.92,male,1
...,...,...,...,...,...
1308,"Zakarian, Mr Artun",3rd,27.00,male,0
1309,"Zakarian, Mr Maprieder",3rd,26.00,male,0
1310,"Zenni, Mr Philip",3rd,22.00,male,0
1311,"Lievens, Mr Rene",3rd,24.00,male,0
1312,"Zimmerman, Leo",3rd,29.00,male,0

In [42]:
bds = bd.sort_values("Age", ascending=False)
bds

,Name,PClass,Age,Sex,Survived
505,"Mitchell, Mr Henry Michael",2nd,71.0,male,0
119,"Goldschmidt, Mr George B",1st,71.0,male,0
9,"Artagaveytia, Mr Ramon",1st,71.0,male,0
72,"Crosby, Captain Edward Gifford",1st,70.0,male,0
73,"Crosby, Mrs Edward Gifford (Catherine Elizabet...",1st,69.0,female,1
...,...,...,...,...,...
1300,"Wiseman, Mr Phillippe",3rd,NaN,male,0
1302,"Yalsevac, Mr Ivan",3rd,NaN,male,1
1305,"Youssef, Mr Gerios",3rd,NaN,male,0
1306,"Zabour, Miss Hileni",3rd,NaN,female,0
1307,"Zabour, Miss Tamini",3rd,NaN,female,0

In [48]:
bdp = bd[(bd["Sex"] == "male") & (bd["Survived"] == 1) & (bd["Age"] <= 40)]
bdp

                                         Name PClass    Age   Sex  Survived
4               Allison, Master Hudson Trevor    1st   0.92  male         1
18                 Beckwith, Mr Richard Leord    1st  37.00  male         1
20                       Behr, Mr Karl Howell    1st  26.00  male         1
22                     Bishop, Mr Dickinson H    1st  25.00  male         1
24    Bjornstrm-Steffansson, Mr Mauritz Hakan    1st  28.00  male         1
...                                       ...    ...    ...   ...       ...
940                      Krekorian, Mr Neshan    3rd  25.00  male         1
948                             Lang, Mr Fang    3rd  26.00  male         1
968                   Lindqvist, Eino William    3rd  20.00  male         1
1258              Tornquist, Mr William Henry    3rd  25.00  male         1
1279                      Vartunian, Mr David    3rd  22.00  male         1

[79 rows x 5 columns]

In [54]:
bdsm = bd[bd["Sex"] == "male"].sort_values("Age")
bdsm

                                        Name PClass   Age   Sex  Survived
751   Danbom, Master Gilbert Sigvard Emanuel    3rd  0.33  male         0
544           Richards, Master George Sidney    2nd  0.80  male         1
358             Caldwell, Master Alden Gates    2nd  0.83  male         1
616                       Aks, Master Philip    3rd  0.83  male         1
4              Allison, Master Hudson Trevor    1st  0.92  male         1
...                                      ...    ...   ...   ...       ...
1295                       Willey, Mr Edward    3rd   NaN  male         0
1296                Williams, Mr Howard Hugh    3rd   NaN  male         0
1300                   Wiseman, Mr Phillippe    3rd   NaN  male         0
1302                       Yalsevac, Mr Ivan    3rd   NaN  male         1
1305                      Youssef, Mr Gerios    3rd   NaN  male         0

[851 rows x 5 columns]

In [60]:
bdswm = bd[bd["Sex"] == "female"].sort_values("Age")
bdswm

                                      Name PClass   Age     Sex  Survived
763   Dean, Miss Elizabeth Gladys (Millve)    3rd  0.17  female         1
478                   LaRoche, Miss Louise    2nd  1.00  female         1
893            Johnson, Miss Eleanor Ileen    3rd  1.00  female         1
936            Klasen, Miss Gertrud Emilia    3rd  1.50  female         0
1188        Sandstrom, Miss Beatrice Irene    3rd  1.50  female         0
...                                    ...    ...   ...     ...       ...
1251            Thorneycroft, Mrs Percival    3rd   NaN  female         1
1259            Touma (Thomas), Mrs Darwin    3rd   NaN  female         0
1261             Touma (Thomas), Miss Hanh    3rd   NaN  female         0
1306                   Zabour, Miss Hileni    3rd   NaN  female         0
1307                   Zabour, Miss Tamini    3rd   NaN  female         0

[462 rows x 5 columns]

In [62]:
bdsdm = bd[bd["Sex"] == "male"].sort_values("Age", ascending=False)
bdsdm

                                Name PClass   Age   Sex  Survived
119         Goldschmidt, Mr George B    1st  71.0  male         0
505       Mitchell, Mr Henry Michael    2nd  71.0  male         0
9             Artagaveytia, Mr Ramon    1st  71.0  male         0
72    Crosby, Captain Edward Gifford    1st  70.0  male         0
252                Straus, Mr Isidor    1st  67.0  male         0
...                              ...    ...   ...   ...       ...
1295               Willey, Mr Edward    3rd   NaN  male         0
1296        Williams, Mr Howard Hugh    3rd   NaN  male         0
1300           Wiseman, Mr Phillippe    3rd   NaN  male         0
1302               Yalsevac, Mr Ivan    3rd   NaN  male         1
1305              Youssef, Mr Gerios    3rd   NaN  male         0

[851 rows x 5 columns]

In [63]:
bdsdwm = bd[bd["Sex"] == "female"].sort_values("Age", ascending=False)
bdsdwm

,Name,PClass,Age,Sex,Survived
73,"Crosby, Mrs Edward Gifford (Catherine Elizabet...",1st,69.0,female,1
67,"Compton, Mrs Alexander Taylor (Mary Eliza Inge...",1st,64.0,female,1
1264,"Turkula, Mrs Hedvig",3rd,63.0,female,1
6,"Andrews, Miss Kornelia Theodosia",1st,63.0,female,1
253,"Straus, Mrs Isidor (Ida Blun)",1st,63.0,female,0
...,...,...,...,...,...
1251,"Thorneycroft, Mrs Percival",3rd,NaN,female,1
1259,"Touma (Thomas), Mrs Darwin",3rd,NaN,female,0
1261,"Touma (Thomas), Miss Hanh",3rd,NaN,female,0
1306,"Zabour, Miss Hileni",3rd,NaN,female,0
1307,"Zabour, Miss Tamini",3rd,NaN,female,0

In [65]:
bdmiss = bd[bd["Name"].str.contains("Miss", case=False)]
bdmiss

                                   Name PClass   Age     Sex  Survived
0          Allen, Miss Elisabeth Walton    1st  29.0  female         1
1           Allison, Miss Helen Loraine    1st   2.0  female         0
6      Andrews, Miss Kornelia Theodosia    1st  63.0  female         1
27               Bonnell, Miss Caroline    1st  30.0  female         1
28              Bonnell, Miss Elizabeth    1st  58.0  female         1
...                                 ...    ...   ...     ...       ...
1269       Van der Planke, Miss Augusta    3rd  18.0  female         0
1276           Van Impe, Miss Catharine    3rd  10.0  female         0
1283  Vestrom, Miss Hulda Amanda Adolfi    3rd  14.0  female         0
1306                Zabour, Miss Hileni    3rd   NaN  female         0
1307                Zabour, Miss Tamini    3rd   NaN  female         0

[236 rows x 5 columns]

In [71]:
bdsc = bd[bd["Name"].str.startswith("Cherry")]
bdsc

                   Name PClass  Age     Sex  Survived
59  Cherry, Miss Gladys    1st  NaN  female         1

In [72]:
bdse = bd[bd["Name"].str.endswith("Rebecca")]
bdse

                          Name PClass   Age     Sex  Survived
69  Compton, Miss Sara Rebecca    1st  39.0  female         1

In [3]:
db = pd.read_csv("Titanic.csv")
db

,Name,PClass,Age,Sex,Survived
0,"Allen, Miss Elisabeth Walton",1st,29.00,female,1
1,"Allison, Miss Helen Loraine",1st,2.00,female,0
2,"Allison, Mr Hudson Joshua Creighton",1st,30.00,male,0
3,"Allison, Mrs Hudson JC (Bessie Waldo Daniels)",1st,25.00,female,0
4,"Allison, Master Hudson Trevor",1st,0.92,male,1
...,...,...,...,...,...
1308,"Zakarian, Mr Artun",3rd,27.00,male,0
1309,"Zakarian, Mr Maprieder",3rd,26.00,male,0
1310,"Zenni, Mr Philip",3rd,22.00,male,0
1311,"Lievens, Mr Rene",3rd,24.00,male,0
1312,"Zimmerman, Leo",3rd,29.00,male,0

In [5]:
db.shape

(1313, 5)

In [6]:
db.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1313 entries, 0 to 1312
Data columns (total 5 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Name      1313 non-null   object
 1   PClass    1312 non-null   object
 2   Age       756 non-null    float64
 3   Sex       1313 non-null   object
 4   Survived  1313 non-null   int64
dtypes: float64(1), int64(1), object(3)
memory usage: 51.4+ KB

In [7]:
db.sample(10)

,Name,PClass,Age,Sex,Survived
852,"Hart, Mr Henry",3rd,NaN,male,0
994,"Markim, Mr Johann",3rd,NaN,male,0
667,"Barry, Miss Julia",3rd,27.0,female,0
256,"Taussig, Mr Emil",1st,52.0,male,0
789,"Ekstrom, Mr Johan",3rd,45.0,male,0
1183,"Salonen, Mr Johan Werner",3rd,NaN,male,0
1304,"Yasbeck, Mrs Antoni",3rd,15.0,female,1
909,"Kalvig, Mr Johannes K Halverson",3rd,21.0,male,0
337,"Becker, Mrs Allen Oliver (Nellie E Baumgardner)",2nd,36.0,female,1
860,"Hellstrom, Hilda Maria",3rd,22.0,female,1

In [10]:
db["Age"].median()

28.0

# zad 1

In [52]:
zad1 = db[~db["PClass"].isna()].sort_values("Name", ascending=False)
zad1

                              Name PClass   Age     Sex  Survived
513              vratil, Mr Michel    2nd  32.0    male         0
514        vratil, Master Michel M    2nd   3.0    male         1
512    vratil, Master Edmond Roger    2nd   2.0    male         1
1060             ughton, Miss Hanh    3rd   NaN  female         0
186             tsch, Mr Charles H    1st  36.0    male         0
...                            ...    ...   ...     ...       ...
606        Abelseth, Miss An Karen    3rd  16.0  female         1
605     Abbott, Mrs Stanton (Rosa)    3rd  35.0  female         1
604     Abbott, Mr Rossmore Edward    3rd  16.0    male         0
603   Abbott, Master Eugene Joseph    3rd  13.0    male         0
602             Abbing, Mr Anthony    3rd  42.0    male         0

[1312 rows x 5 columns]

# zad 2

In [51]:
zad2 = db[db["PClass"] == "2nd"]["Age"].median()
zad2

28.0

# zad 3

In [35]:
zad3 = db[~db["Age"].isna()].sort_values(["Age", "Name"], ascending=[False, True])
zad3

,Name,PClass,Age,Sex,Survived
9,"Artagaveytia, Mr Ramon",1st,71.00,male,0
119,"Goldschmidt, Mr George B",1st,71.00,male,0
505,"Mitchell, Mr Henry Michael",2nd,71.00,male,0
72,"Crosby, Captain Edward Gifford",1st,70.00,male,0
73,"Crosby, Mrs Edward Gifford (Catherine Elizabet...",1st,69.00,female,1
...,...,...,...,...,...
616,"Aks, Master Philip",3rd,0.83,male,1
358,"Caldwell, Master Alden Gates",2nd,0.83,male,1
544,"Richards, Master George Sidney",2nd,0.80,male,1
751,"Danbom, Master Gilbert Sigvard Emanuel",3rd,0.33,male,0
763,"Dean, Miss Elizabeth Gladys (Millve)",3rd,0.17,female,1

# zad 4

In [39]:
zad4 = db[(db["Sex"] == "male")].sort_values(["Age"], ascending=[False])
zad4

                                Name PClass   Age   Sex  Survived
119         Goldschmidt, Mr George B    1st  71.0  male         0
505       Mitchell, Mr Henry Michael    2nd  71.0  male         0
9             Artagaveytia, Mr Ramon    1st  71.0  male         0
72    Crosby, Captain Edward Gifford    1st  70.0  male         0
252                Straus, Mr Isidor    1st  67.0  male         0
...                              ...    ...   ...   ...       ...
1295               Willey, Mr Edward    3rd   NaN  male         0
1296        Williams, Mr Howard Hugh    3rd   NaN  male         0
1300           Wiseman, Mr Phillippe    3rd   NaN  male         0
1302               Yalsevac, Mr Ivan    3rd   NaN  male         1
1305              Youssef, Mr Gerios    3rd   NaN  male         0

[851 rows x 5 columns]